{
  "main": {
    "name":"Andrew Grube",
    "occupation":"DevOps Engineer II",
    "description":"AWS Certified Solutions Architect - Professional with 6 years of experience in IT, and 4 years experience in AWS technologies. In-depth experience with high availability, cost-effective, fault-tolerant systems.",
    "image":"profile.png",
    "bio":"AWS Certified Solutions Architect - Professional with 6 years of experience in IT, and 4 years experience in AWS technologies. In-depth experience with high availability, cost-effective, fault-tolerant systems.",
    "contactmessage":"Feel free to send me an e-mail.",
    "email": "andrewmgrube@gmail.com",
    "phone": "(913) 375-4353",
    "address":{
      "street":"",
      "city":"",
      "state":"",
      "zip": ""
    },
    "website": "http://www.andrewgrube.com",
    "resumedownload":"https://andrewgrube.com/files/resume.pdf",
    "social":[
      {
        "name":"twitter",
        "url":"http://twitter.com/GhostCodeKC",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/andrew-grube-74124821/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/GhostCodeKC",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/GhostCodeKC",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Johnson County Community College",
        "degree":"Computer Information Systems",
        "graduated":"August 2008 - August 2012",
        "description":"https://www.jccc.edu/"
      },
      {
        "school":"AWS Certified Solutions Architect - Professional",
        "degree":"SAP Certificate",
        "graduated":"May 7, 2021 - May 7, 2024",
        "description":"https://www.credly.com/badges/57503cab-7a7b-4956-a553-e11b51f5114e/public_url"
      },
      {
        "school":"AWS Certified Solutions Architect - Associate",
        "degree":"SAA Certificate",
        "graduated":"May 7, 2021 - May 7, 2024",
        "description":"https://www.credly.com/badges/be3a9a6a-bacf-4493-89fb-21b6308e0f3e/public_url"
      },
      {
        "school":"HashiCorp Certified: Terraform Associate",
        "degree":"Hashicorp Certificate",
        "graduated":"May 11, 2021 - May 11, 2023",
        "description":"https://www.credly.com/badges/69274e42-97bb-47ff-9d9f-ea38a8b011e8/public_url"
      },
      {
        "school":"AWS Certified Cloud Practitioner",
        "degree":"CLF Certificate",
        "graduated":"May 13, 2021 - May 13, 2024",
        "description":"https://www.credly.com/badges/6e24c9c6-bb9d-4d7c-baa9-c1f3927e24dc/public_url"
      }
    ],
    "work":[
      {
        "company":"SelectQuote",
        "title":[
          ["DevOps Engineer II"]
        ],
        "years":[
          ["March 2021 - Present"]
        ],
        "item": [
          [
            ["Deployment of new Amazon ECS services for Population Health."],
            ["Assisted the App Support team to improve a poorly performing Serverless function in AWS."],
            ["Configured Bitbucket CI/CD pipeline for Serverless Python 3.6 Lambda deployment with imports that rely on native packages that aren’t included in AWS Lambda environments."],
            ["Created an AWS QuickSight group manager integrated with Google SSO developed  in Python. This application stack is running on Lambda and deployed with Serverless framework and automated with BitBucket pipelines."],
            ["Documented and deployed infrastructure of the new disaster recovery environment in Terraform using best practices and automating documentation with terraform-docs using pre-commit githooks."]
          ]
        ]
      },
      {
        "company":"Data Systems International Inc.",
        "title":[
          ["DevOps Engineer"], 
          ["Cloud Engineer"], 
          ["Cloud Systems Administrator"], 
          ["Customer Success Consultant I/II"]
        ],
        "years":[
          ["November 2019 - March 2020"], 
          ["March 2019 - November 2019"],
          ["August 2018 - March 2019"],
          ["October 2014 - August 2018"]
        ],
        "item": [
          [
            ["Created Lambda Function in Python 3.8 to automatically block IP addresses scanning production AWS Classic ELB."],
            ["Developed an internal customer information website in Javascript using AWS Cognito, OneLogin SSO, AWS CodeCommit, and AWS Amplify"],
            ["Architected extended data access model for customer."],
            ["Performed penetration tests with Greenbone Networks open source software running in a Kali Linux VM."],
            ["Installed and configured cloud based Jenkins server for DSI analytics developers."],
            ["Configured and deployed AWS SSO connected by OneLogin with MFA"]
          ],
          [
            ["Developed Lambda functions to programmatically back up EBS volumes for mission critical servers nightly and reduce cost bydeleting old backups on a revolving schedule."],
            ["Created and deployed scalable CloudFormation application stack for infinite scaling of new software deployments."],
            ["Worked with SCPaaS team for infrastructure review, DevOps strategy, and deploying test environments with Terraform."],
            ["Worked with CloudInventory team to deploy and manage API cluster for new application functionality."],
            ["Lead and developed weekly CloudOperations Success Through Synergy discussion to share information and increase knowledge of our AWS architecture and applications."]
          ],
          [
            ["Creating and deploying VPC, security, and application CloudFormation stacks in 5 regions for 2 software stacks."],
            ["Facilitated the implementation of production, stage, and test server monitoring in Grafana by communicating objectives to teams, and departments, coordinating timelines to ensuresuccessful launch."],
            ["Lead the CI/CD efforts of our “customer portal” application in ECS with full CodePipeline integration and stored source in Git."],
            ["Fulfilled administrative duties, including: production server monitoring, creating production server alerting mechanisms, cost reduction plans, constant review of CIS security compliance guidelines."]
          ],
          [
            ["Resolving client and consultant issues with DSI supported software and hardware."], 
            ["Maintaining an exceptional level of training and experience on all of our products; including new and revised software and hardware."],
            ["Documenting issue resolutions, creating software defect reports and enhancement requests as appropriate."]
          ]
        ]
      }
    ],
    "skills":[]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Andrew Grube",
        "category":"Personal Website & Blog",
        "image":"resume-website.jpg",
        "url":"https://www.andrewgrube.com"
      },
      {
        "title":"Dev.to Blog Post",
        "category":"Blogpost",
        "image":"dev.to-cw-blogpost.png",
        "url":"https://daily.dev/posts/configuring-cloudwatch-logs-for-identifying-memory-leaks-on-windows-workloads-in-aws"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Andrew Grube must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
